# Программа с созданием процессов

## Описание задания

Написать программу на языке C, которая:
1. Создает два процесса с помощью `fork()`
2. Дочерний процесс запускает команду `ls -la` с помощью `execl()`
3. Родительский процесс ожидает завершения дочернего с помощью `wait()`
4. Родитель выводит сообщение о завершении команды

## Технические требования

- **Используемые системные вызовы**: `fork()`, `exec()`, `wait()`, `getpid()`, `getppid()`
- **Обработка ошибок**: все ошибки обрабатываются с помощью функции `perror()`
- **Компиляция**: `gcc -Wall -Wextra -o task task.c`

## Инструкция по запуску

### 1. Подготовка исходного кода

Создайте файл `task.c` со следующим содержимым:

```c
#include <stdio.h>
#include <stdlib.h>
#include <unistd.h>
#include <sys/wait.h>
#include <errno.h>

int main() {
    pid_t pid;
    
    printf("Родительский процесс: PID = %d\n", getpid());
    
    // Создание дочернего процесса
    pid = fork();
    
    if (pid < 0) {
        // Ошибка при создании процесса
        perror("Ошибка при создании процесса (fork)");
        exit(EXIT_FAILURE);
    }
    
    if (pid == 0) {
        // Дочерний процесс
        printf("Дочерний процесс: PID = %d, PPID = %d\n", getpid(), getppid());
        printf("Дочерний процесс запускает команду: ls -la\n");
        
        // Запуск команды ls -la
        execl("/bin/ls", "ls", "-la", NULL);
        
        // Если execl вернул управление, значит произошла ошибка
        perror("Ошибка при запуске команды (execl)");
        exit(EXIT_FAILURE);
    } else {
        // Родительский процесс
        int status;
        
        printf("Родительский процесс ждёт завершения дочернего (PID = %d)\n", pid);
        
        // Ожидание завершения дочернего процесса
        if (wait(&status) == -1) {
            perror("Ошибка при ожидании завершения процесса (wait)");
            exit(EXIT_FAILURE);
        }
        
        // Проверка статуса завершения дочернего процесса
        if (WIFEXITED(status)) {
            printf("Команда ls завершена с кодом возврата: %d\n", WEXITSTATUS(status));
        } else if (WIFSIGNALED(status)) {
            printf("Команда ls завершена сигналом: %d\n", WTERMSIG(status));
        }
        
        printf("Родительский процесс завершает работу\n");
    }
    
    return EXIT_SUCCESS;
}

## Пример вывода программы:
Родительский процесс: PID = 12345
Дочерний процесс: PID = 12346, PPID = 12345
Дочерний процесс запускает команду: ls -la
Родительский процесс ждёт завершения дочернего (PID = 12346)
итого 48
drwxr-xr-x  2 user user  4096 дек 10 14:30 .
drwxr-xr-x 10 user user  4096 дек 10 14:29 ..
-rwxr-xr-x  1 user user 16752 дек 10 14:30 task
-rw-r--r--  1 user user   950 дек 10 14:30 task.c
Команда ls завершена с кодом возврата: 0
Родительский процесс завершает работу