# Программа подсчета букв 'a' и 'A'

## Описание задания

Написать программу на языке C, которая:
1. Читает текстовый файл `text.txt` (содержит более 200 символов)
2. Подсчитывает количество строчных букв 'a' и прописных букв 'A'
3. Записывает результаты подсчета в файл `count.txt`
4. Использует только системные вызовы для работы с файлами

## Технические требования

- **Используются только системные вызовы**: `open()`, `read()`, `write()`, `close()`
- **Запрещено использовать**: `fopen()`, `fprintf()`, `fscanf()` и другие функции стандартной библиотеки
- **Обработка ошибок**: все ошибки обрабатываются с помощью функции `perror()`
- **Компиляция**: `gcc -Wall -Wextra -o task task.c`

## Структура файлов
├── task.c # Основная программа
├── generate_text.c # Генератор файла text.txt (опционально)
├── text.txt # Входной файл с текстом (≥200 символов)
└── count.txt # Выходной файл с результатами (создается программой)

## Результат выполнения
1. Подсчёт завершён. Результат записан в count.txt
2. Найдено: 14 'a' и 0 'A'