# Обработка сигналов в Linux

## Описание задания

Написать программу на языке C для обработки сигналов в Linux, которая:
1. Считает от 1 до 100 с задержкой 1 секунда между итерациями
2. При получении сигнала `SIGUSR1` выводит текущее значение счетчика
3. При получении сигнала `SIGTERM` корректно завершает работу
4. Использует безопасные функции для работы в обработчиках сигналов

## Технические требования

- **Использование функций**: `signal()` или `sigaction()` для установки обработчиков
- **Безопасность обработчиков**: использование только async-signal-safe функций
- **Глобальные переменные**: использование `volatile sig_atomic_t` для флагов
- **Компиляция**: стандартная компиляция gcc

## Инструкция по запуску

### 1. Создание файла с исходным кодом

Создайте файл `task.c` со следующим содержимым:

```c
#include <stdio.h>
#include <stdlib.h>
#include <signal.h>
#include <unistd.h>
#include <string.h>

volatile sig_atomic_t counter = 0;
volatile sig_atomic_t running = 1;

void safe_write(const char* str) {
    write(STDOUT_FILENO, str, strlen(str));
}

void handle_sigusr1(int sig) {
    char buffer[100];
    snprintf(buffer, sizeof(buffer), 
             "\n[SIGUSR1] Текущий счетчик: %d\n", counter);
    write(STDOUT_FILENO, buffer, strlen(buffer));
}

void handle_sigterm(int sig) {
    write(STDOUT_FILENO, "\n[SIGTERM] Завершение работы\n", 28);
    running = 0;
}

int main() {
    printf("PID: %d\n", getpid());
    printf("Отправьте SIGUSR1 для показа счетчика\n");
    printf("Отправьте SIGTERM для завершения\n\n");
    
    signal(SIGUSR1, handle_sigusr1);
    signal(SIGTERM, handle_sigterm);
    
    for (counter = 1; counter <= 100 && running; counter++) {
        printf("Счетчик: %d\n", counter);
        sleep(1);
    }
    
    printf("\nПрограмма завершена. Счетчик: %d\n", counter - 1);
    return 0;
}
## Вывод

./task
PID: 2285
Отправьте SIGUSR1 для показа счетчика
Отправьте SIGTERM для завершения

Счетчик: 1
Счетчик: 2
Счетчик: 3
Счетчик: 4
Счетчик: 5
Счетчик: 6
Счетчик: 7
Счетчик: 8
Счетчик: 9
Счетчик: 10
Счетчик: 11
Счетчик: 12
Счетчик: 13
Счетчик: 14
Счетчик: 15
Счетчик: 16
Счетчик: 17
Счетчик: 18
Счетчик: 19
Счетчик: 20
Счетчик: 21
Счетчик: 22
Счетчик: 23
Счетчик: 24
Счетчик: 25
Счетчик: 26
Счетчик: 27
Счетчик: 28
Счетчик: 29
Счетчик: 30
Счетчик: 31
Счетчик: 32
Счетчик: 33
Счетчик: 34
Счетчик: 35
Счетчик: 36
Счетчик: 37
Счетчик: 38
Счетчик: 39
Счетчик: 40
Счетчик: 41
Счетчик: 42
Счетчик: 43
Счетчик: 44
Счетчик: 45
Счетчик: 46
Счетчик: 47
Счетчик: 48
Счетчик: 49
Счетчик: 50
Счетчик: 51
Счетчик: 52
Счетчик: 53
Счетчик: 54
Счетчик: 55
Счетчик: 56
Счетчик: 57
Счетчик: 58
Счетчик: 59
Счетчик: 60
Счетчик: 61
Счетчик: 62
Счетчик: 63
Счетчик: 64
Счетчик: 65
Счетчик: 66
Счетчик: 67
Счетчик: 68
Счетчик: 69
Счетчик: 70
Счетчик: 71
Счетчик: 72
Счетчик: 73
Счетчик: 74
Счетчик: 75
Счетчик: 76
Счетчик: 77
Счетчик: 78
Счетчик: 79
Счетчик: 80
Счетчик: 81
Счетчик: 82
Счетчик: 83
Счетчик: 84
Счетчик: 85
Счетчик: 86
Счетчик: 87
Счетчик: 88
Счетчик: 89
Счетчик: 90
Счетчик: 91
Счетчик: 92
Счетчик: 93
Счетчик: 94
Счетчик: 95
Счетчик: 96
Счетчик: 97
Счетчик: 98
Счетчик: 99
Счетчик: 100

Программа завершена. Счетчик: 100



chmod +x test_signal.sh
./test_signal.sh
=== Тестирование программы обработки сигналов ===
Компиляция программы...
Запуск программы в фоновом режиме...
PID программы: 2313

Ожидание 3 секунды...
PID: 2313
Отправьте SIGUSR1 для показа счетчика
Отправьте SIGTERM для завершения

Счетчик: 1
Счетчик: 2
Счетчик: 3

1. Отправка SIGUSR1 (показать счетчик)...

[SIGUSR1] Текущий счетчик: 3
Счетчик: 4
Счетчик: 5

2. Отправка SIGUSR1 еще раз...

[SIGUSR1] Текущий счетчик: 5
Счетчик: 6
Счетчик: 7
Счетчик: 8
Счетчик: 9

3. Отправка SIGTERM (завершение)...


[SIGTERM] Завершен�Ожидание завершения программы...

Программа завершена. Счетчик: 9


