# Многопоточные вычисления с использованием pthread

## Описание задания

Написать программу на языке C с использованием библиотеки pthread, которая:
1. Создает два потока для параллельных вычислений
2. Первый поток вычисляет сумму чисел от 1 до 1000
3. Второй поток вычисляет произведение чисел от 1 до 10 (10!)
4. Потоки возвращают результаты через `pthread_exit()`
5. Главный поток выводит оба результата

## Технические требования

- **Использование библиотеки**: `pthread` (POSIX threads)
- **Используемые функции**: `pthread_create()`, `pthread_join()`, `pthread_exit()`
- **Компиляция**: `gcc -pthread -o task task.c`

## Инструкция по запуску

### 1. Создание файла с исходным кодом

Создайте файл `task.c` со следующим содержимым:

```c
#include <stdio.h>
#include <stdlib.h>
#include <pthread.h>

// Функция для вычисления суммы чисел от 1 до 1000
void* calculate_sum(void* arg) {
    long long* sum = (long long*)arg;
    *sum = 0;
    
    for (int i = 1; i <= 1000; i++) {
        *sum += i;
    }
    
    printf("Поток суммы: вычисление завершено\n");
    pthread_exit((void*)sum);
}

// Функция для вычисления произведения чисел от 1 до 10
void* calculate_product(void* arg) {
    long long* product = (long long*)arg;
    *product = 1;
    
    for (int i = 1; i <= 10; i++) {
        *product *= i;
    }
    
    printf("Поток произведения: вычисление завершено\n");
    pthread_exit((void*)product);
}

int main() {
    pthread_t thread_sum, thread_product;
    long long sum_result = 0;
    long long product_result = 0;
    int ret;
    
    printf("=== Программа многопоточных вычислений ===\n");
    
    // Создаем поток для вычисления суммы
    ret = pthread_create(&thread_sum, NULL, calculate_sum, (void*)&sum_result);
    if (ret != 0) {
        fprintf(stderr, "Ошибка создания потока суммы: %d\n", ret);
        return EXIT_FAILURE;
    }
    
    // Создаем поток для вычисления произведения
    ret = pthread_create(&thread_product, NULL, calculate_product, (void*)&product_result);
    if (ret != 0) {
        fprintf(stderr, "Ошибка создания потока произведения: %d\n", ret);
        pthread_join(thread_sum, NULL);
        return EXIT_FAILURE;
    }
    
    // Ожидаем завершения потоков
    pthread_join(thread_sum, NULL);
    pthread_join(thread_product, NULL);
    
    // Выводим результаты
    printf("\n=== Результаты вычислений ===\n");
    printf("Сумма чисел от 1 до 1000: %lld\n", sum_result);
    printf("Произведение чисел от 1 до 10: %lld\n", product_result);
    
    return EXIT_SUCCESS;
}

        ## Вывод
        === Программа многопоточных вычислений ===
        Главный поток запущен (ID: 136780292691776)
        
        Создаем поток для вычисления суммы чисел 1-1000...
        Поток суммы создан (ID: 136780290455232)
        Создаем поток для вычисления произведения чисел 1-10...
        Поток суммы: вычисление завершено, сумма = 500500
        Поток произведения создан (ID: 136780282062528)
        
        Главный поток ожидает завершения дочерних потоков...
        Поток произведения: вычисление завершено, произведение = 3628800
        Поток суммы завершился успешно
        Поток произведения завершился успешно
        
        === Результаты вычислений ===
        Сумма чисел от 1 до 1000: 500500
        ✓ Результат верен (проверено по формуле n*(n+1)/2)
        Произведение чисел от 1 до 10 (10!): 3628800
        ✓ Результат верен (10! = 3,628,800)
        
        === Программа успешно завершена ===