# Отладка с использованием strace

## Описание задания

Написать программу на языке C, которая читает данные из стандартного ввода (stdin) и записывает их в стандартный вывод (stdout), затем проанализировать ее работу с помощью утилиты `strace`.

### Задачи:
1. Создать программу, которая читает из stdin и пишет в stdout
2. Запустить программу под `strace`
3. Найти и проанализировать вызовы `read()` и `write()`
4. Подсчитать количество вызовов этих системных вызовов
5. Сохранить команды и результаты в файл `analysis.txt`

## Технические требования

- **Использование strace**: анализ системных вызовов программы
- **Сохранить результаты**: все команды и вывод должны быть сохранены в файле
- **Программа**: должна использовать `read()` и `write()` для работы с вводом/выводом
- **Компиляция**: стандартная компиляция gcc

## Инструкция по запуску

### 1. Создание файла с исходным кодом

Создайте файл `task.c` со следующим содержимым:

```c
#include <stdio.h>
#include <unistd.h>

int main() {
    char buffer[100];
    ssize_t n;
    
    printf("Введите текст (Ctrl+D для завершения):\n");
    
    while ((n = read(0, buffer, sizeof(buffer) - 1)) > 0) {
        buffer[n] = '\0';
        write(1, buffer, n);
    }
    
    return 0;
}